[
  {
    "id": "d0e76c38-d770-468c-b178-6a6a4acf9053",
    "title": "5 USC(3331) Rev D.pdf",
    "source_path": "E:\\AI Projects\\polisim\\project guidelines\\policies and legislation\\5 USC(3331) Rev D.pdf",
    "pages": 1,
    "keywords": [
      "act",
      "section"
    ],
    "snippet": "5 U.S.C. § 1333 - Oath of Oﬃce (a) Requirement.—An individual, except the President, elected or appointed to an oﬃce of honor or proﬁt in the civil service or uniformed services, shall, before entering upon the duties of such oﬃce, take and subscribe the following oath (or aﬃrmation): “I, [name], do solemnly swear (or aﬃrm) that I will support and defend the Constitution of the United States against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; that in all my oﬃcial words, acts, testimony, and proceedings I will, to the utmost of my power and ability, speak nothing but the truth, grounded upon sure and veriﬁable evidence, and that, upon lawful request of any member of Congress or of the people, I will forthwith produce or duly cite the authorities and proofs thereof; that I take this obligation freely, without any mental reservation or purpose of evasion; and that I will well and faithfully discharge the duties of the oﬃce on which I am about to enter: So help me God.” (b) Administration.—The oath required by subsection (a) shall be administered by an oﬃcer authorized by law to administer oaths. (c) Effect.—An individual who violates the oath taken under this section shall be subject to removal from oﬃce and such other penalties as may be provided by law. Galactic Organization of Development",
    "metadata": {}
  },
  {
    "id": "f5253f27-18a1-4e1f-9f62-37d5244e2d50",
    "title": "Article 1 S2C2 Rev B.pdf",
    "source_path": "E:\\AI Projects\\polisim\\project guidelines\\policies and legislation\\Article 1 S2C2 Rev B.pdf",
    "pages": 1,
    "keywords": [
      "act",
      "section",
      "article",
      "clause"
    ],
    "snippet": "Article I, Section 2, Clause 2: No Person shall be a Representative who is not a second-generation citizen of the United States—deﬁned as a person born anywhere to at least one parent who is a citizen of the United States at the time of such birth— who shall not have attained to the Age of twenty ﬁve Years, and who shall not, when elected, be an Inhabitant of that State in which he shall be chosen. Galactic Organization of Development",
    "metadata": {}
  },
  {
    "id": "4b04df42-b468-4b95-95ef-388661a4cf06",
    "title": "Article 1 S3C3 Rev B.pdf",
    "source_path": "E:\\AI Projects\\polisim\\project guidelines\\policies and legislation\\Article 1 S3C3 Rev B.pdf",
    "pages": 1,
    "keywords": [
      "act",
      "section",
      "article",
      "clause"
    ],
    "snippet": "Article I, Section 3, Clause 3: No Person shall be a Senator who is not a second-generation citizen of the United States—deﬁned as a person born anywhere to at least one parent who is a citizen of the United States at the time of such birth—who shall not have attained to the Age of thirty Years, and who shall not, when elected, be an Inhabitant of that State for which he shall be chosen Galactic Organization of Development",
    "metadata": {}
  },
  {
    "id": "8350077f-e4ac-41c8-aa88-3088cd5f39b9",
    "title": "Article 1 section 5 clause 2 amendment.pdf",
    "source_path": "E:\\AI Projects\\polisim\\project guidelines\\policies and legislation\\Article 1 section 5 clause 2 amendment.pdf",
    "pages": 1,
    "keywords": [
      "amend",
      "section",
      "article",
      "legis",
      "clause"
    ],
    "snippet": "Article I, Section 5, Clause 2 of the Constitution of the United States (Proposed Amendment): Each House may determine the Rules of its Proceedings, punish its Members for disorderly Behaviour, and, with the Concurrence of two thirds, expel a Member; provided, however, that under no circumstances shall any citizen of the United States who is a second-generation or greater American citizen be denied the right to introduce legislation directly to the Congress openly and publicly for consideration, litigation, and debate.",
    "metadata": {}
  },
  {
    "id": "6dbd199f-6a9e-48b5-a07d-0903de56c1b9",
    "title": "ERPO REV5.pdf",
    "source_path": "E:\\AI Projects\\polisim\\project guidelines\\policies and legislation\\ERPO REV5.pdf",
    "pages": 24,
    "keywords": [
      "act",
      "amend",
      "section",
      "erpo"
    ],
    "snippet": "Michigan Extreme Risk Protection Order Act (Act 38 of 2023, as amended REV 5) 691.1801 Short title. Sec. 1. This act may be cited as the \"extreme risk protection order act\". 691.1803 Deﬁnitions. Sec. 3. As used in this act: (a) \"C.J.I.S. policy council act\" means the C.J.I.S. policy council act, 1974 PA 163, MCL 28.211 to 28.215. (b) \"Dating relationship\" means a relationship that consists of frequent, intimate associations primarily characterized by the expectation of affectional involvement. Dating relationship does not include a casual relationship or an ordinary fraternization between 2 individuals in a business or social context. (c) \"Extreme risk protection order\" means an order issued by a court under section 7. (d) \"Family member\" means an individual who is related to the respondent as any of the following: (i) A parent. (ii) A son or daughter. (iii) A sibling. (iv) A grandparent. (v) A grandchild. (vi) An uncle or aunt. (vii) A ﬁrst cousin. (e) \"Guardian\" means that term as deﬁned in section 1104 of the estates and protected individuals code, 1998 PA 386, MCL 700.1104.",
    "metadata": {}
  },
  {
    "id": "11b53ef4-7db5-4184-ac5b-71d2313317cc",
    "title": "Screen Act rev D.pdf",
    "source_path": "E:\\AI Projects\\polisim\\project guidelines\\policies and legislation\\Screen Act rev D.pdf",
    "pages": 5,
    "keywords": [
      "act",
      "section",
      "screen",
      "legis"
    ],
    "snippet": "H. R. 1623 To require operating systems for interactive computing devices to implement secure setup modes to protect minors from harmful content, and for other purposes. IN THE HOUSE OF REPRESENTATIVES February 26, 2025 Mrs. Miller of Illinois (for herself, Mr. Van Drew, Mr. Brecheen, Mr. LaMalfa, Mr. Austin Scott of Georgia, Mr. Kennedy of Utah, Mr. Crane, Mr. Aderholt, Mr. Babin, and Mr. Rose) introduced the following bill; which was referred to the Committee on Energy and Commerce. A BILL To require operating systems for interactive computing devices to implement secure setup modes to protect minors from harmful content, and for other purposes. Be it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, SECTION 1. SHORT TITLE. This Act may be cited as the “Shielding Children's Retinas from Egregious Exposure on the Net Act” or the “SCREEN Act”. SEC. 2. FINDINGS; SENSE OF CONGRESS. (a) Findings.—Congress ﬁnds the following: (1) Over the 3 decades preceding the date of enactment of this Act, Congress has passed several bills to protect minors from access to online pornographic content, including title V of the Telecommunications Act of 1996 (Public Law 104–104) (commonly known as the “Communications Decency Act”), section 231 of the Communications Act of 1934 (47 U.S.C. 231) (commonly known as the “Child Online Protection Act”), and the Children’s Internet Protection Act (title XVII of division B of Public Law 106–554). (2) With the exception of the Children's Internet Protection Act (title XVII of division B of Public Law 106– 554), the Supreme Court of the United States has struck down the previous efforts of Congress to shield children from pornographic content, ﬁnding that such legislation constituted a “compelling government interest” but that it was not the least restrictive means to achieve such interest. In Ashcroft v. ACLU, 542 U.S. 656 (2004), the Court even suggested at the time that “blocking and ﬁlter",
    "metadata": {}
  },
  {
    "id": "dbc3a8a3-7dfc-495a-84c7-61f1b7bf77a7",
    "title": "V1.22 United States Galactic Health Act of 2025.pdf",
    "source_path": "E:\\AI Projects\\polisim\\project guidelines\\policies and legislation\\V1.22 United States Galactic Health Act of 2025.pdf",
    "pages": 14,
    "keywords": [
      "health",
      "act",
      "section",
      "debt"
    ],
    "snippet": "**United States Galactic Health Act of 2025** Preamble 119th CONGRESS 1st Session H.R. ____ **IN THE HOUSE OF REPRESENTATIVES** December 5, 2025 Mr. Timothy Harrington Nordyke (for himself and cosponsors) introduced the following bill; which was referred to the Committee on Energy and Commerce, and in addition to the Committees on Ways and Means, Education and the Workforce, and Oversight and Accountability, for a period to be subsequently determined by the Speaker, in each case for consideration of such provisions as fall within the jurisdiction of the committee concerned. A BILL To establish a universal zero-out-of-pocket healthcare system for all citizens and legal permanent residents, permanently eliminate medical bankruptcy, reduce national health expenditures to an average below 7 percent of gross domestic product within twenty years, accelerate the largest biomedical and longevity innovation boom in history, and generate ﬁscal surpluses equivalent to 1–2 percent of gross domestic product annually by 2040 for debt reduction, infrastructure, education, scientiﬁc research, space exploration, and direct taxpayer rebates while preserving maximum individual choice and aligning national biology with multiplanetary imperatives. Be it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, --- **TITLE I: GENERAL PROVISIONS** **CHAPTER 1: SHORT TITLE, TABLE OF CONTENTS, FINDINGS, AND PURPOSES** **Section 1. Short Title; Table of Contents** (a) Short Title.—This Act may be cited as the \"United States Galactic Health Act of 2025\". (b) Table of Contents.—The table of contents for this Act is as follows: Sec. 1. Short title; table of contents. Sec. 2. Findings and purposes. Sec. 3. Deﬁnitions. Sec. 4. Establishment of the Galactic Department of Health and universal coverage. Sec. 5. Opt-out provisions and voucher system. Sec. 6. Funding mechanisms and transition. Sec. 7. Private insurance transition and supplemental options",
    "metadata": {}
  }
]